title: Potential OpenSSH Backdoor Logging Activity
# id: generate one here https://www.uuidgenerator.net/version4
status: experimental
description: |
    Identifies a Secure Shell (SSH) client or server process creating or writing to a known SSH backdoor log file.
    Adversaries may modify SSH related binaries for persistence or credential access via patching sensitive functions to
    enable unauthorized access or to log SSH credentials for exfiltration.
# references:
#     - A list of all references that can help a reader or analyst understand the meaning of a triggered rule
tags:
    - attack.T1556
    - attack.TA0006
    - attack.T1554
    - attack.TA0003
author: Ali Mosajjal
date: 2022/04/04  # Rule date
logsource:
    category: eventstream
detection:
    paths: 
      - args:
        - /private/etc/
        - /usr/share/
        - /usr/include/
        - /usr/local/include/
        - /private/tmp/
        - /private/var/tmp/
        - /usr/tmp/
        - /usr/share/man/
        - /usr/local/share/
        - /usr/lib/
        - /private/etc/ssh/.sshd_auth
        - /usr/bin/ssd
        - /private/var/opt/power
        - /private/etc/ssh/ssh_known_hosts
        - /private/var/html/lol
        - /private/var/log/utmp
        - /private/var/lib
        - /var/run/sshd/sshd.pid
        - /var/run/nscd/ns.pid
        - /var/run/udev/ud.pid
        - /var/run/udevd.pid
    extensions:
        - .sock
        - .ini
        - .in
        - .out
    condition: 1 of paths and 1 of extensions
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - |
        Security tools and device drivers may run these programs in order to enumerate kernel modules. Use of these programs
        by ordinary users is uncommon. These can be exempted by process name or username.
level: medium