title: Sensitive Files Compression
status: production
description: |
    Identifies the use of a compression utility to collect known files containing sensitive information, such as credentials
    and system configurations.
# references:
#     - A list of all references that can help a reader or analyst understand the meaning of a triggered rule
tags:
    - attack.T1552
    - attack.T1552.001
    - attack.TA0006
    - attack.T1560
    - attack.T1560.001
    - attack.TA0009

author: Ali Mosajjal
date: 2022/04/04  # Rule date
logsource:
    category: eventstream
detection:
    arguments: 
      - args|contains:
        - /root/.ssh/id_rsa
        - /root/.ssh/id_rsa.pub
        - /root/.ssh/id_ed25519
        - /root/.ssh/id_ed25519.pub
        - /root/.ssh/authorized_keys
        - /root/.ssh/authorized_keys2
        - /root/.ssh/known_hosts
        - /root/.bash_history
        - /etc/hosts
        - /home/*/.ssh/id_rsa
        - /home/*/.ssh/id_rsa.pub
        - /home/*/.ssh/id_ed25519
        - /home/*/.ssh/id_ed25519.pub
        - /home/*/.ssh/authorized_keys
        - /home/*/.ssh/authorized_keys2
        - /home/*/.ssh/known_hosts
        - /home/*/.bash_history
        - /root/.aws/credentials
        - /root/.aws/config
        - /home/*/.aws/credentials
        - /home/*/.aws/config
        - /root/.docker/config.json
        - /home/*/.docker/config.json
        - /etc/group
        - /etc/passwd
        - /etc/shadow
        - /etc/gshadow
    commands:
      - cmd|contains:
        - 'zip'
        - 'gzip'
        - 'tar'
        - 'cat'
        - 'hdiutil'
        - '7z'
    condition: 1 of commands and 1 of arguments
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - |
        Security tools and device drivers may run these programs in order to enumerate kernel modules. Use of these programs
        by ordinary users is uncommon. These can be exempted by process name or username.
level: medium