title: File Deletion via Shred
# id: generate one here https://www.uuidgenerator.net/version4
status: experimental
description: |
    Malware or other files dropped or created on a system by an adversary may leave traces behind as to what was done within
    a network and how. Adversaries may remove these files over the course of an intrusion to keep their footprint low or
    remove them at the end as part of the post-intrusion cleanup process.
# references:
#     - A list of all references that can help a reader or analyst understand the meaning of a triggered rule
tags:
    - attack.T1070
    - attack.T1070.004
    - attack.TA0005
author: Ali Mosajjal
date: 2022/04/04  # Rule date
logsource:
    category: eventstream
detection:
    command:
      - cmd|contains:
        - "shred"
    arguments:
      - args|contains:
        - "-u"
        - "--remove"
        - "-z"
        - "--zero"
    condition: all of command and 1 of arguments
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - none
level: medium